tap "cartr/qt4"
tap "d12frosted/emacs-plus"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-core.git"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "kyoh86/tap"
tap "openresty/brew"
tap "universal-ctags/universal-ctags"
brew "openssl@1.1"
brew "readline"
brew "xz"
brew "glib"
brew "pkg-config"
brew "gdk-pixbuf"
brew "gobject-introspection"
brew "icu4c"
brew "pango"
brew "librsvg"
brew "ant"
brew "aria2"
brew "gcc"
brew "boost"
brew "asciidoc"
brew "autoenv"
brew "autojump"
brew "automake"
brew "autossh"
brew "bat"
brew "bazel"
brew "blueutil"
brew "boost@1.60"
brew "ghc"
brew "cabal-install"
brew "coreutils"
brew "libev"
brew "cask"
brew "llvm"
brew "ccls"
brew "chezscheme"
brew "chicken"
brew "cloc"
brew "cmake"
brew "consul"
brew "cpanminus"
brew "cscope"
brew "cucumber-cpp"
brew "dashing"
brew "dbus", restart_service: true
brew "direnv"
brew "ditaa"
brew "imagemagick"
brew "mailutils"
brew "emacs-head@27", args: ["with-cocoa", "with-mailutils", "with-modern-icon-black-variant", "with-xwidgets"]
brew "libsodium"
brew "et"
brew "exa"
brew "exchangerate"
brew "fcitx-remote-for-osx"
brew "fd"
brew "feh"
brew "snappy"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "fnm"
brew "fswatch"
brew "fzf"
brew "gdb"
brew "gdbgui"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-extras"
brew "git-flow"
brew "git-lfs"
brew "glances"
brew "global"
brew "gnu-sed"
brew "gnupg"
brew "lua"
brew "go"
brew "go-langserver"
brew "golangci-lint"
brew "googler"
brew "graphviz"
brew "grc"
brew "gtm"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "hugo"
brew "iproute2mac"
brew "irssi"
brew "ispell"
brew "jq"
brew "json-c"
brew "ledger"
brew "leveldb"
brew "libarchive"
brew "libfixposix"
brew "libgccjit"
brew "libiconv"
brew "libvirt", restart_service: true
brew "libvterm"
brew "lolcat"
brew "lorem"
brew "luajit"
brew "luarocks"
brew "mercurial"
brew "ninja"
brew "meson"
brew "minimal-racket"
brew "mono", link: false
brew "mosh"
brew "most"
brew "multitail"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "nethogs"
brew "nmap"
brew "node"
brew "nvm"
brew "texinfo"
brew "octave"
brew "parallel"
brew "pidof"
brew "pipx"
brew "plantuml"
brew "platypus"
brew "poetry"
brew "qt"
brew "poppler"
brew "protoc-gen-go"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "rustup-init"
brew "sbcl"
brew "shellcheck"
brew "sloccount"
brew "socat"
brew "stow"
brew "subversion"
brew "ta-lib"
brew "terminal-notifier"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "thefuck"
brew "thrift"
brew "thrift@0.9"
brew "tig"
brew "tldr"
brew "tmux"
brew "transcrypt"
brew "tree"
brew "typescript", link: false
brew "vim"
brew "wget"
brew "wireguard-tools"
brew "wrk"
brew "yabai"
brew "yadm"
brew "yarn"
brew "you-get"
brew "zeal", args: ["HEAD"]
brew "zlib"
brew "zsh"
brew "cartr/qt4/qt-webkit@2.3"
brew "cartr/qt4/pyqt@4"
brew "eth-p/software/bat-extras"
brew "jeffreywildman/virt-manager/virt-manager"
brew "jeffreywildman/virt-manager/virt-viewer"
brew "kyoh86/tap/exportloopref"
brew "openresty/brew/openresty"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "adoptopenjdk8"
cask "alacritty"
cask "anki"
cask "docker"
cask "dotnet"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-firago"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gas-mask"
cask "hammerspoon"
cask "iterm2"
cask "java"
cask "kitty"
cask "launchcontrol"
cask "mactex"
cask "oni"
cask "osxfuse"
cask "platypus"
cask "rar"
cask "sourcetree"
cask "squirrel"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "vulkan-sdk"
cask "wireshark"
cask "xquartz"
